# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

nuM = input("Введите число: ")
suM = 0
for i in nuM:
    suM += int(i)
print(suM)
